<?php

/**
 * Transliterate string to a-z A-Z. Attempts to convert everything we know of.
 * Unknown chars remain.
 * @param $str - string to transliterate.
 * @return - the transliterated string.
 */
function transliterate(string $str): string {
    $find = ["À","à","Á","á","Â","â","Ã","ã","Ä","ä","Å","å","Ā","ā","Ă","ă","Ǻ","ǻ","Ǎ","ǎ","Ą","ą","Ç","ç","Ć","ć","Ĉ","ĉ","Ċ","ċ","Č","č","Ð","Ď","ď","Đ","đ","È","è","É","é","Ê","ê","Ë","ë","Ē","ē","Ĕ","ĕ","Ė","ė","Ę","ę","Ě","ě","ƒ","Ĝ","ĝ","Ğ","ğ","Ġ","ġ","Ģ","ģ","Ĥ","ĥ","Ħ","ħ","Ǐ","ǐ","Ì","ì","Í","í","Î","î","Ï","ï","Ĩ","ĩ","Ī","ī","Ĭ","ĭ","Į","į","İ","ı","Ĵ","ĵ","Ķ","ķ","Ĺ","ĺ","Ļ","ļ","Ľ","ľ","Ŀ","ŀ","Ł","ł","Ń","ń","Ņ","ņ","Ň","ň","Ñ","ñ","ŉ","Ò","ò","Ó","ó","Ô","ô","Õ","õ","Ö","ö","Ø","ø","Ơ","ơ","Ǒ","ǒ","Ō","ō","Ŏ","ŏ","Ő","ő","Ǿ","ǿ","Ŕ","ŕ","Ŗ","ŗ","Ř","ř","Ś","ś","Ŝ","ŝ","Ş","ş","Š","š","ſ","Ţ","ţ","Ť","ť","Ŧ","ŧ","Ù","ù","Ú","ú","Û","û","Ü","ü","Ư","ư","Ǔ","ǔ","Ǖ","ǖ","Ǘ","ǘ","Ǚ","ǚ","Ǜ","ǜ","Ũ","ũ","Ū","ū","Ŭ","ŭ","Ů","ů","Ű","ű","Ų","ų","Ŵ","ŵ","Ý","ý","Ÿ","ÿ","Ŷ","ŷ","Ź","ź","Ż","ż","Ž","ž","Æ","æ","Ǽ","ǽ","Ĳ","ĳ","Œ","œ","ß","ẞ"];
    $replace = ["A","a","A","a","A","a","A","a","A","a","A","a","A","a","A","a","A","a","A","a","A","a","C","c","C","c","C","c","C","c","C","c","D","D","d","D","d","E","e","E","e","E","e","E","e","E","e","E","e","E","e","E","e","E","e","f","G","g","G","g","G","g","G","g","H","h","H","h","I","i","I","i","I","i","I","i","I","i","I","i","I","i","I","i","I","i","I","i","J","j","K","k","L","l","L","l","L","l","L","l","L","l","N","n","N","n","N","n","N","n","n","O","o","O","o","O","o","O","o","O","o","O","o","O","o","O","o","O","o","O","o","O","o","O","o","R","r","R","r","R","r","S","s","S","s","S","s","S","s","s","T","t","T","t","T","t","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u","U","u",  "W","w","Y","y","Y","y","Y","y","Z","z","Z","z","Z","z","AE","ae","AE","ae","IJ","ij","OE","oe","SS","ss"];
    return str_replace($find, $replace, $str);
}
?>

